{
  "_name_or_path": "Crystalcareai/GemMoE-Beta-1",
  "architectures": [
    "GemmoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_implementation": "flash_attention_2",
  "auto_map": {
    "AutoConfig": "Crystalcareai/GemMoE-Beta-1--configuration_gemmoe.GemmoeConfig",
    "AutoModelForCausalLM": "Crystalcareai/GemMoE-Beta-1--modeling_gemmoe.GemmoeForCausalLM",
    "AutoTokenizer": "Crystalcareai/GemMoE-Beta-1--tokenization_gemmoe.GemmoeTokenizer"
  },
  "bos_token_id": 2,
  "eos_token_id": 1,
  "head_dim": 256,
  "hidden_act": "gelu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 8192,
  "model_type": "gemmoe",
  "num_attention_heads": 16,
  "num_experts_per_tok": 1,
  "num_hidden_layers": 8,
  "num_key_value_heads": 16,
  "num_local_experts": 2,
  "output_router_logits": false,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.02,
  "sliding_window": null,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.2",
  "use_cache": false,
  "vocab_size": 256000
}